In [1]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
import matplotlib.pyplot as plt

In [6]:
## Subsetting Series

In [7]:
h= pd.Series(np.array([1,7,9]))
print(h)

0    1
1    7
2    9
dtype: int64

In [8]:
h.loc[2]

9

In [9]:
h.loc[:2]

0    1
1    7
2    9
dtype: int64

In [10]:
h.loc[[0,1]]

0    1
1    7
dtype: int64

In [11]:
h.iloc[2]

9

In [12]:
h.iloc[:2]

0    1
1    7
dtype: int64

In [16]:
h.iloc[[0,1]]

0    1
1    7
dtype: int64

Exercise 1: Extract a individual value (5), slice for row indexed with 2 till 3 and a list of indecices for the row indexed with 1 and 3 from the series named t created from the array([3,5,7,8]))

In [44]:
t = pd.Series(np.array([3, 5, 7, 8]))
t1 = t.iloc[1]
t2 = t.loc[2:3]
t3 = t.loc[[1,3]]
print('Extract a individual value (5):\n', t1, '\nslice for row indexed with 2 till 3:\n', t2, '\nslice a list of indecices for the row indexed with 1 and 3:\n', t3 )

Extract a individual value (5):
 5
slice for row indexed with 2 till 3:
 2    7
3    8
dtype: int64
slice a list of indecices for the row indexed with 1 and 3:
 1    5
3    8
dtype: int64

In [45]:
print('t'  'e')

te

In [ ]:
t= pd.Series(np.array([3,5,7,8]))
t

In [ ]:
## Subsetting DataFrame

In [46]:
States = pd.read_csv('states_by_country_code.csv')
print(States)

     State Code                   State Name Country Code
0           BDS                   Badakhshan           AF
1           BDG                      Badghis           AF
2           BGL                      Baghlan           AF
3           BAL                        Balkh           AF
4           BAM                       Bamyan           AF
...         ...                          ...          ...
4984         MW    Mashonaland West Province           ZW
4985         MV            Masvingo Province           ZW
4986         MN  Matabeleland North Province           ZW
4987         MS  Matabeleland South Province           ZW
4988         MI            Midlands Province           ZW

[4989 rows x 3 columns]

In [47]:
States.loc[:, 'Country Code']

0       AF
1       AF
2       AF
3       AF
4       AF
        ..
4984    ZW
4985    ZW
4986    ZW
4987    ZW
4988    ZW
Name: Country Code, Length: 4989, dtype: object

In [48]:
States['Country Code']

0       AF
1       AF
2       AF
3       AF
4       AF
        ..
4984    ZW
4985    ZW
4986    ZW
4987    ZW
4988    ZW
Name: Country Code, Length: 4989, dtype: object

In [49]:
States.loc[:, ['Country Code']]

     Country Code
0              AF
1              AF
2              AF
3              AF
4              AF
...           ...
4984           ZW
4985           ZW
4986           ZW
4987           ZW
4988           ZW

[4989 rows x 1 columns]

In [50]:
States[['Country Code']]

     Country Code
0              AF
1              AF
2              AF
3              AF
4              AF
...           ...
4984           ZW
4985           ZW
4986           ZW
4987           ZW
4988           ZW

[4989 rows x 1 columns]

In [51]:
States[['Country Code','State Code']]

     Country Code State Code
0              AF        BDS
1              AF        BDG
2              AF        BGL
3              AF        BAL
4              AF        BAM
...           ...        ...
4984           ZW         MW
4985           ZW         MV
4986           ZW         MN
4987           ZW         MS
4988           ZW         MI

[4989 rows x 2 columns]

In [52]:
States.loc[:,'State Code':'State Name']

     State Code                   State Name
0           BDS                   Badakhshan
1           BDG                      Badghis
2           BGL                      Baghlan
3           BAL                        Balkh
4           BAM                       Bamyan
...         ...                          ...
4984         MW    Mashonaland West Province
4985         MV            Masvingo Province
4986         MN  Matabeleland North Province
4987         MS  Matabeleland South Province
4988         MI            Midlands Province

[4989 rows x 2 columns]

In [53]:
States.loc[:, :'State Name']

     State Code                   State Name
0           BDS                   Badakhshan
1           BDG                      Badghis
2           BGL                      Baghlan
3           BAL                        Balkh
4           BAM                       Bamyan
...         ...                          ...
4984         MW    Mashonaland West Province
4985         MV            Masvingo Province
4986         MN  Matabeleland North Province
4987         MS  Matabeleland South Province
4988         MI            Midlands Province

[4989 rows x 2 columns]

Exercise 2: Read the country_full.csv file, and select all columns after 'sub-region' columns and save it to a file named country_columnselection.csv (method for saving: your_data.to_csv('your_output'))

In [66]:
Ex2 = pd.read_csv('country_full.csv')
Ex2_subset = Ex2.loc[:, 'sub-region':]
Ex2_subset.to_csv('Ex2_subset_export')
Ex2_subset.to_csv('Ex2_subset_export2', index = False)

In [67]:
States.loc[[0], :]

  State Code  State Name Country Code
0        BDS  Badakhshan           AF

In [68]:
States.loc[0:3, :]

  State Code  State Name Country Code
0        BDS  Badakhshan           AF
1        BDG     Badghis           AF
2        BGL     Baghlan           AF
3        BAL       Balkh           AF

In [70]:
States.iloc[0:3, :]

  State Code  State Name Country Code
0        BDS  Badakhshan           AF
1        BDG     Badghis           AF
2        BGL     Baghlan           AF

In [71]:
States.loc[[0, 2], :]

  State Code  State Name Country Code
0        BDS  Badakhshan           AF
2        BGL     Baghlan           AF

In [72]:
States.iloc[[0, 2], :]

  State Code  State Name Country Code
0        BDS  Badakhshan           AF
2        BGL     Baghlan           AF

Exercise 3: Select the 2nd (refer to index) to 4th (refer to index) rows for State Code and Country Code columns in states_by_country_code.csv file. Do .iloc method for rows and .loc method for columns relying on a shortcut data.iloc[].loc[]

Exercise 4: Extract the 'BDS' from states_by_country_code.csv file by .iloc method

In [111]:
State_bcc = pd.read_csv('states_by_country_code.csv')
State_bcc.iloc[2:5, :].loc[:,['State Code', 'Country Code']]

  State Code Country Code
2        BGL           AF
3        BAL           AF
4        BAM           AF

In [121]:
State_bcc.iloc[0, 0]

'BDS'

In [122]:
country = pd.read_csv('country_full.csv')
print(country)
country['region-code'].iloc[0:5].to_numpy()

                  name alpha-2 alpha-3  country-code     iso_3166-2   region
0          Afghanistan      AF     AFG             4  ISO 3166-2:AF     Asia  \
1        Ã…land Islands      AX     ALA           248  ISO 3166-2:AX   Europe
2              Albania      AL     ALB             8  ISO 3166-2:AL   Europe
3              Algeria      DZ     DZA            12  ISO 3166-2:DZ   Africa
4       American Samoa      AS     ASM            16  ISO 3166-2:AS  Oceania
..                 ...     ...     ...           ...            ...      ...
244  Wallis and Futuna      WF     WLF           876  ISO 3166-2:WF  Oceania
245     Western Sahara      EH     ESH           732  ISO 3166-2:EH   Africa
246              Yemen      YE     YEM           887  ISO 3166-2:YE     Asia
247             Zambia      ZM     ZMB           894  ISO 3166-2:ZM   Africa
248           Zimbabwe      ZW     ZWE           716  ISO 3166-2:ZW   Africa

             sub-region intermediate-region  region-code  sub-region-code
0         Southern Asia                 NaN        142.0             34.0  \
1       Northern Europe                 NaN        150.0            154.0
2       Southern Europe                 NaN        150.0             39.0
3       Northern Africa                 NaN          2.0             15.0
4             Polynesia                 NaN          9.0             61.0
..                  ...                 ...          ...              ...
244           Polynesia                 NaN          9.0             61.0
245     Northern Africa                 NaN          2.0             15.0
246        Western Asia                 NaN        142.0            145.0
247  Sub-Saharan Africa      Eastern Africa          2.0            202.0
248  Sub-Saharan Africa      Eastern Africa          2.0            202.0

     intermediate-region-code
0                         NaN
1                         NaN
2                         NaN
3                         NaN
4                         NaN
..                        ...
244                       NaN
245                       NaN
246                       NaN
247                      14.0
248                      14.0

[249 rows x 11 columns]

array([142., 150., 150.,   2.,   9.])

In [123]:
country.iloc[0:5, 8:11].to_numpy()

array([[142.,  34.,  nan],
       [150., 154.,  nan],
       [150.,  39.,  nan],
       [  2.,  15.,  nan],
       [  9.,  61.,  nan]])

In [159]:
a = country['region-code'].iloc[0:5]

In [125]:
a.to_list()

[142.0, 150.0, 150.0, 2.0, 9.0]

In [158]:
country.iloc[0:5, 8:11].to_numpy().tolist()

[[142.0, 34.0, nan],
 [150.0, 154.0, nan],
 [150.0, 39.0, nan],
 [2.0, 15.0, nan],
 [9.0, 61.0, nan]]

Exercise 5: Read the currency.csv file, select a series as well as a dataframe and convert them to the array and to the list

In [139]:
currency = pd.read_csv('currency.csv')
currency

    Code Symbol                      Name
0    AED    Ø¯.Ø¥    United Arab Emirates d
1    AFN      Ø‹            Afghan afghani
2    ALL      L              Albanian lek
3    AMD    AMD             Armenian dram
4    ANG      Æ’  Netherlands Antillean gu
..   ...    ...                       ...
158  XOF    CFA    West African CFA franc
159  XPF     Fr                 CFP franc
160  YER      ï·¼               Yemeni rial
161  ZAR      R        South African rand
162  ZMW     ZK            Zambian kwacha

[163 rows x 3 columns]

In [181]:
ser = currency['Symbol'].iloc[0:3]

currency.iloc[0:5, :2].to_numpy().tolist()

[['AED', 'Ø¯.Ø¥'], ['AFN', 'Ø‹'], ['ALL', 'L'], ['AMD', 'AMD'], ['ANG', 'Æ’']]

In [ ]:
h= pd.Series(np.array([1,7,9]))
print(h)

In [ ]:
h.index = ['a', 'b', 'c']
print(h)

In [ ]:
States = pd.read_csv('states_by_country_code.csv')
print(States)

In [ ]:
States = States.set_index('State Code')
print(States)

In [ ]:
h.reset_index(drop=True)

In [ ]:
States = States.reset_index()
States

In [ ]:
States.sort_values('State Name')

In [ ]:
States.sort_values('State Name', ascending=False)

In [ ]:
###plotting

In [ ]:
country = pd.read_csv('country_full.csv')
print(country)

In [ ]:
country[['country-code', 'region-code']].hist();

Try it on 2nd row and all the columns

In [ ]:
country['country-code'].plot();

In [ ]:
country.set_index('name')['country-code'].plot();

In [ ]:
country.plot.scatter(x='country-code', y='region-code');

Exercise 6: Read the climate.csv file to a variable named 'climate', generate a line plot from 'Temperature (Celsius)', in the next step change the index to Country and in the 3rd step create a plot with all 3 variables. (put the title and axes labels)

In [ ]:
###Operators

In [ ]:
climate = pd.read_csv('climate.csv')
print(climate)

In [ ]:
climate['Temperature (Celsius)'].min()

In [ ]:
climate['Temperature (Celsius)'].max()

In [ ]:
climate['Temperature (Celsius)'].mean()

In [ ]:
climate[['Temperature (Celsius)','Humidity (%)']].mean()

In [ ]:
climate[['Temperature (Celsius)','Humidity (%)']]-10

In [ ]:
climate['df'] = climate['Temperature (Celsius)'] - climate['Humidity (%)']
print(climate)

In [ ]:
climate.set_index('Date')['df'].plot();

Exercise 7: create a column as the sum of the wind speed and humidity and create a scatter plot between the new column and the temperature

In [ ]:
climate['sum'] = climate['Wind Speed (km/h)'] + climate['Humidity (%)']
print(climate)

In [ ]:
climate.plot.scatter(x='sum', y='Temperature (Celsius)');

Exercise 8: Add a column named 'rain' with an duplicated value over all rows

In [ ]:
climate = climate.drop(['sum'], axis=1)
climate

In [ ]:
climate[climate['Date'] > 2023-5-3]

Reference: https://jupyter.org https://the-turing-way.netlify.app/communication/binder/zero-to-binder.html https://docs.python.org https://wsform.com/knowledgebase/sample-csv-files/ https://geobgu.xyz/py/